Tekla Open API Reference for Tekla Structures 2025
ArrowheadAttributes Class
 The ArrowheadAttributes class handles attributes related to arrowheads of different objects.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.ArrowheadAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ArrowheadAttributes : GenericAttributesBase
<SerializableAttribute>
Public NotInheritable Class ArrowheadAttributes
	Inherits GenericAttributesBase
The ArrowheadAttributes type exposes the following members.
Constructors
Name | Description
ArrowheadAttributes()
 Creates a new default arrowhead attributes instance. The default values are ArrowheadPositions.None, ArrowheadTypes.FilledArrow, height 2.0 and width 1.0.
ArrowheadAttributes(ArrowheadPositions, ArrowheadTypes, Double, Double)
 Creates a new arrowhead attributes instance with the given parameters.
Top
Properties
Name | Description
ArrowPosition
 The position of the arrowhead. The position is always ArrowheadPositions.Both for dimensions.
Head
 The type of the arrowhead.
Height
 The height of the arrowhead.
Width
 The width of the arrowhead.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace